# Customer Shared - Staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
./src/customer/shared/infrastructure/workspaces/staging relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/Connectilly/Connectilly/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/Connectilly/Connectilly

To view this run in a browser, visit:
https://app.terraform.io/app/Connectilly/customer-shared-staging/runs/run-NKLfjLgYiagkgFSN

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
module.database.cockroach_cluster.default: Refreshing state... [id=bfad5b64-2446-46f4-88c1-08ea8a31671a]
module.database.cockroach_database.default: Refreshing state... [id=bfad5b64-2446-46f4-88c1-08ea8a31671a:customer]
module.database.aws_ssm_parameter.default: Refreshing state... [id=customer-shared-staging-customer-cluster-id]
module.database_user.data.aws_ssm_parameter.cluster_id: Refreshing...
module.database_user.aws_ssm_parameter.username: Refreshing state... [id=customer-shared-staging-customer-shared-username]
module.database_user.random_password.password: Refreshing state... [id=none]
module.database_user.aws_ssm_parameter.password: Refreshing state... [id=customer-shared-staging-customer-shared-password]
module.database_user.data.aws_ssm_parameter.cluster_id: Refresh complete after 1s [id=customer-shared-staging-customer-cluster-id]
module.database_user.cockroach_sql_user.default: Refreshing state... [id=bfad5b64-2446-46f4-88c1-08ea8a31671a:customer-shared]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.database_user.aws_ssm_parameter.password will be updated in-place
  ~ resource "aws_ssm_parameter" "password" {
        id             = "customer-shared-staging-customer-shared-password"
      + insecure_value = (known after apply)
        name           = "customer-shared-staging-customer-shared-password"
        tags           = {
            "domain"        = "customer"
            "environment"   = "customer-shared-staging"
            "resource"      = "customer-shared"
            "resource_type" = "database_user"
        }
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.database_user.cockroach_sql_user.default will be updated in-place
  ~ resource "cockroach_sql_user" "default" {
        id         = "bfad5b64-2446-46f4-88c1-08ea8a31671a:customer-shared"
        name       = "customer-shared"
      ~ password   = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.database_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      + override_special = "!#$%&*()-_=+[]{}<>:?" # forces replacement
      ~ result           = (sensitive value)
        # (10 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*